// page/pages/index/test/test.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: {
      jtjj: {
        title: '集团简介',
        content: [
          { image: '../../../assets/images/banner1.jpg' },
          {text: '希望美术教育是专业从事美术教学和研究的全国连锁教育机构，成立于2004年10月，总部位于首都北京，希望美术教育的专业、完整、高品质的教育服务得到了社会的认可和社会各界一致好评，先后荣获了“中国少儿教育最具影响力品牌”、“中国服务业优秀特许加盟品牌”、“全国少儿美术教育杰出贡献单位”、“中国民办教育协会理事单位”、2012“全国最具发展前景的艺术教育机构”、2013“全国最具品牌价值教育连锁机构”、2013“中国十大品牌影响力艺术教育机构”、2014“最具社会知名度教育机构”、2014“中国最具品牌竞争力艺术教育机构”、“中国教育培训联盟少儿美术分盟主席单位”、2015“中国品牌影响力教育集团”、2015“年度艺术教育创新品牌”、“CCTV央视网广告合作伙伴”、“2016中国知名度教育机构”、2017“CCTV10科教频道品牌展播”、“优秀传统文化传播教学单位”、“2017年度品牌影响力教育机构”、2017“中国品牌影响力艺术教育机构”等多项荣誉。' },
          {text: '经过十四年规范化办学，截止2018年1月，希望美术教育在全国各省市共建立了400余家校区，2000余名专业敬业的全职老师，在校生二十万余人，现已发展成为全国少儿美术教育领军品牌，成为全国综合实力最强的少儿美术教育品牌。'}
        ]
      },
      jyln: {
        title: '教育理念',
        content: [
          { image: '../../../assets/images/banner1.jpg' },
          { text: '倡导现代教育理念，促进少儿美术教育健康发展。'},
          {text: '教学理念：用艺术启迪智慧 。 '},
          {text: '教育理念：品格第一 、 素质第二 、兴趣第三 、 成绩第四。'},
          {text: '教育承诺：教好每一个学生，办好每一件事。'},
          {text: '教学观念：优秀的学生是优秀的教师培养出来的。'},
          {text:'教师准则：悉心教学、趣味生动、谦虚自律、认真负责、锐意进取、高效执行' }
        ]
      },
      jyts: {
        title: '教育特色',
        content: [
          { text: 'Characteristic', class: 'blue'},
          { text: '希望美术教育教学特色', class: 'blue'},
          { text: '国际化教育理念，专业名师授课；' },
          { text: '激励式教学模式和赏识式教育；' },
          { text: '品格教育与素质教育贯穿课堂始终；' },
          { text: '鼓励积极参与绘画比赛、定期举办画展，提升学生自信；' },
          { text: '四大课程体系，选择性多元化；' },
          { text: '递进式教学方式，因材施教，个性教育；' },
          { text: '书法、手工、手抄报等实用性多元化课堂学习；' },
          {text: '开展不同主题生日会、艺术大讲堂、亲子课堂、创意课堂、外出写生活动美术主题写生 夏令营……增强学生及家长业余文化生活；' },
          { text: '注重家校沟通，强化教学服务，完善教师工作闭环。真正做到“教好每一个学生，办好 每一件事”；' },
          { text: '倡导教师不断自我学习提升、与时俱进，做一个有教育情怀、教育梦想、教育责任的优 秀少儿美术教师' }
        ]
      },
      sdys: {
        title: '课程体系',
        content: [
          { image: '../../../assets/images/kctx.jpg', class: 'kctx'}
        ]
      },
      lxwm: {
        title: '联系我们',
        content: [
          { image: '../../../assets/images/lxwm.jpg'},
          {text: '咨询电话：18531628845'},
          {text: '地址：固安县惠文东街京南绿洲底商129号希望美术教育'}
        ]
      },
      ldzc: {
        title: '领导致辞',
        content: [
          { image: '../../../assets/images/ldzc.jpg'},
          {
            text: '时光荏苒，希望已稳健地走过了十四个春秋。现已成长为全国少儿美术教育领军品牌。不断完善现代少儿美术教育课程体系，每年举办全国少儿美术师资研修班，希望正致力于提升中国人的综合素养，担当起倡导现代少儿美育的社会使命。'},
          {
            text: '希望美术教育所取得的成绩，是各级领导、社会各界朋友十四年来关心和支持的结果，是全体希望人励精图治、奋勇拼搏的结晶，凝聚着大家的智慧和汗水，值得所有希望人欣慰和自豪，并为之继续努力奋斗。'},
            {text: '希望美术教育注重想象力和创新力的培养，品格教育和艺术素养的结合。多彩艺术视界的营造和多元化课题设置更好地为孩子提供了发现自己潜力的可能。同时，我们将一如既往践行“品格第一、素质第二、兴趣第三、成绩第四”的教育观，深入贯彻“用艺术启迪智慧”的教育理念！'},
            {
              text: '大道之行，希望再起点，我们将提供最先进的少儿美术教学理念、最优质的少儿美术教育教研课件和最好的少儿美术培训解决方案。'},
            { text:'希望美术教育欢迎每一个孩子，每一个家庭，每一个有志于教育事业的伙伴的加入，让我们携手前行，为实现伟大的中国梦贡献自己一份力量。'}
        ]
      },
      zpda: {
        title: '家长须知',
        content: [
          { text: '服务保证', class: 'blue' },
          { text: '1. 希望美术教育向学员提供高三年级之前各年龄段各级别的课程服务。' },
          { text: '2. 希望美术教育全年提供在读学员美术课程服务（清明、五一、暑假夏令营周末、中秋、十一、春节两个周学校正常放假不在课时范围内）。' },
          { text: '3. 除本协议另有约定外，在就读课程开课四周内，家长可申请退还剩余学费，超过四周或8课时，任何情况不再办理退费。' },
          { text: '学员报名、开课及课时调整', class: 'blue' },
          { text: '1.	家长为学员报名前请仔细阅读《学员报名须知》；' },
          { text: '2.	学员报名时需提供一寸彩照2张，请务必认真填写报名新生登记表，学校将根据此表对学生进行编班和建立永久学生档案库。' },
          { text: '3.	学员于开课前因个人原因无法按期开课或需调整上课时间，家长因在接到学校通知之日起三日内与学校协商，否则视为已开课。' },
          { text: '4.	在第三次上课结束前，家长可向学校申请转校或调整课程类型。在确定新的校区或课程后，学校将扣除学员已经发生的费用，包括已完成的课时费和已使用的材料费用，剩余款项用于支付变更后的课程费用，多退少补。学员在就读期间，只能申请一次转校以及课程变更。'},
          { text: '5.	除暂停课程外，学员所有常规班课程必须在开课后按课时规定完成所有课时（就读期间），否则视为学员自动放弃剩余课时（不可抗力情形除外）。'},
          { text: '课程暂停、请假及补课', class: 'blue'},
          { text:'1.	如需请假需家长当面或电话提前请假，为了不影响学员课程进度，所缺课时需在一个月内补上，未请假或确定补课时间后未按时出席的，视为学员自动放弃所缺课时。'},
          { text: '2.	学校按照国家法定节假日放假，但可根据需要对课程进行调整。'},
          { text: '3.	寒暑假期间，学校将根据实际情况安排上课时间。'},
          { text: '校区纪律/违纪',class:'blue'},
          { text:'1．	学员不得将玩具或电子玩具等非学习用品带到学校。若有遗失，学校将不负责任。'},
          { text:'2．	学员在校期间若有任何不当行为，例如：辱骂他人、毁坏学校设备及严重扰乱课堂教学等，学校将给与警告处分；情节特别严重或经两次警告仍再次违反学校纪律的，学校有权终止其课程，取消其课时且不予退还未完成课程的费用，但该惩罚并不能免除该学员及家长应承担的相应赔偿责任。'},
          { text:'3．	因学员的行为给学校或者第三方造成的任何人身损害或财产损失，学员及家长进行赔偿；同时该学员及家长应使学校免于卷入任何因学员的行为所引起与任何第三方的法律纠纷；若学校因学员的行为而承担任何赔偿责任的，有权就此向该学员及家长追偿。'}
        ]
      },
      jzn: {
        title: '巨嘴鸟',
        content: [
          { image: '../../../assets/images/\zuopin/jzn.jpg' },
          { text: '作品点评：' },
          { text: '本次绘画使用了勾边笔、彩色卡纸、剪刀、油画棒、双面胶等材料。采用黑白线描与油画棒结合的形式。' },
          { text: '通过讲解巨嘴鸟的生活习性，让学生了解了巨嘴鸟的基本特征。学会了画面细节的处理，即巨嘴鸟身体、羽毛怎样用花纹进行添加。结合巨嘴鸟的生存环境，开发了学生的发散性思维，学会了处理背景环境，同时培养了学生爱护动物保护环境的意识。' }
        ]
      },
      baihe: {
        title: '百合',
        content: [
          { image: '../../../assets/images/\zuopin/baihe.jpg' },
          { text: '作品点评：' },
          {
            text: '百合花姿雅致，叶片青翠娟秀，茎干亭亭玉立，是名贵的切花新秀。通过学习，学生们了解了百合花的基本形态和生活习性。熟练掌握了勾勒法并结合书法用笔来描绘百合花的轮廓。百合花具有百年好合、美好家庭、伟大的爱之含意。通过学习百合花，让孩子们也更加热爱自己的家庭。'
          }
        ]
      },
      xiaoniao: {
        title: '林中的小鸟',
        content: [
          { image: '../../../assets/images/\zuopin/xiaoniao.jpg' },
          { text: '作品点评：' },
          {
            text: '小朋友们通过对森林与小鸟的观察，学会了合理利用小鸟在画面上的构图布局；对树干的‘扭’的动作训练，锻炼了孩子的手部肌肉发育。小朋友们学会了小鸟的画法与粘贴，锻炼了孩子们的控笔能力与专注力。'
          }
        ]
      },
      xiaoxiong: {
        title: '玩偶小熊',
        content: [
          { image: '../../../assets/images/\zuopin/xiaoxiong.jpg' },
          { text: '作品点评：' },
          {
            text: '通过对熟悉的玩偶小熊进行色彩创作，能够通过点彩的方式表现物体的光感与体积感。通过画画，小朋友们也了解了玩具熊的外形特征与质感。感受到色彩变化的魅力。'
          }
        ]
      },
      ying: {
        title: '鹰',
        content: [
          { image: '../../../assets/images/\zuopin/ying.jpg' },
          { text: '作品点评：' },
          {
            text: '通过本次绘画，学生们了解了老鹰的基本画法，并通过练习感受到画鹰时用笔用墨的变化。在画鹰时体现书法用笔， 体验墨色浓淡、干湿变化，感受到笔墨变化带来的乐趣，丰富学生的审美感受，提高了笔墨造型的能力。学习到老鹰身上想要重生敢于挑战自我的精神！'
          }
        ]
      },
      szlb: {
        title: '师资列表',
        list: [
          {
            title: 'Horace',
            query: 'horace',
            subTitle: '灵感研究院院长',
            content: 'Horace院长中国农工党党员希望美术教育联合创始人',
            image: '../../../assets/images/sjl.jpg'
          },
          {
            title: '徐凤华',
            query: 'xfh',
            subTitle: '希望美术教育 常务副总裁',
            content: '北京希望师资学院 高级讲师 教育培训行业金牌管理专家',
            image: '../../../assets/images/xfh.jpg'
          },
          {
            title: '杜蕾',
            query: 'dll',
            subTitle: '希望美术教育 副总裁',
            content: '希望美术教育 教学总监 北京希望师资学院 高级研发总监',
            image: '../../../assets/images/dll.jpg'
          },
          {
            title: '刁望隐',
            query: 'dwy',
            subTitle: '希望美术教育 副总裁',
            content: '北京希望师资学院 高级讲师 教育培训行业高级品牌营销专家',
            image: '../../../assets/images/dwy.jpg'
          },
          {
            title: '杨东',
            query: 'yd',
            subTitle: '希望美术教育 行政副总监',
            content: '北京希望师资学院 高级讲师 灵感少儿美术教育研究院培训导师',
            image: '../../../assets/images/yd.jpg'
          }
        ]
      }
    },
    current: {}
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
    this.setData({
      current: this.data.list[this.options.q]
    })
    wx.setNavigationBarTitle({
      title: this.data.current.title
    })
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})