// page/pages/index/test/test.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: {
      jtjj: {
        title: '集团简介',
        content: [
          { image: '../../../assets/images/banner1.jpg' },
          {text: '希望美术教育是专业从事美术教学和研究的全国连锁教育机构，成立于2004年10月，总部位于首都北京，希望美术教育的专业、完整、高品质的教育服务得到了社会的认可和社会各界一致好评，先后荣获了“中国少儿教育最具影响力品牌”、“中国服务业优秀特许加盟品牌”、“全国少儿美术教育杰出贡献单位”、“中国民办教育协会理事单位”、2012“全国最具发展前景的艺术教育机构”、2013“全国最具品牌价值教育连锁机构”、2013“中国十大品牌影响力艺术教育机构”、2014“最具社会知名度教育机构”、2014“中国最具品牌竞争力艺术教育机构”、“中国教育培训联盟少儿美术分盟主席单位”、2015“中国品牌影响力教育集团”、2015“年度艺术教育创新品牌”、“CCTV央视网广告合作伙伴”、“2016中国知名度教育机构”、2017“CCTV10科教频道品牌展播”、“优秀传统文化传播教学单位”、“2017年度品牌影响力教育机构”、2017“中国品牌影响力艺术教育机构”等多项荣誉。' },
          {text: '经过十四年规范化办学，截止2018年1月，希望美术教育在全国各省市共建立了400余家校区，2000余名专业敬业的全职老师，在校生二十万余人，现已发展成为全国少儿美术教育领军品牌，成为全国综合实力最强的少儿美术教育品牌。'}
        ]
      },
      jyln: {
        title: '教育理念',
        content: [
          { image: '../../../assets/images/banner1.jpg' },
          { text: '倡导现代教育理念，促进少儿美术教育健康发展。'},
          {text: '教学理念：用艺术启迪智慧 。 '},
          {text: '教育理念：品格第一 、 素质第二 、兴趣第三 、 成绩第四。'},
          {text: '教育承诺：教好每一个学生，办好每一件事。'},
          {text: '教学观念：优秀的学生是优秀的教师培养出来的。'},
          {text:'教师准则：悉心教学、趣味生动、谦虚自律、认真负责、锐意进取、高效执行' }
        ]
      },
      jyts: {
        title: '教育特色',
        content: [
          { text: 'Characteristic', class: 'blue'},
          { text: '希望美术教育教学特色', class: 'blue'},
          { text: '国际化教育理念，专业名师授课；' },
          { text: '激励式教学模式和赏识式教育；' },
          { text: '品格教育与素质教育贯穿课堂始终；' },
          { text: '鼓励积极参与绘画比赛、定期举办画展，提升学生自信；' },
          { text: '四大课程体系，选择性多元化；' },
          { text: '递进式教学方式，因材施教，个性教育；' },
          { text: '书法、手工、手抄报等实用性多元化课堂学习；' },
          {text: '开展不同主题生日会、艺术大讲堂、亲子课堂、创意课堂、外出写生活动美术主题写生 夏令营……增强学生及家长业余文化生活；' },
          { text: '注重家校沟通，强化教学服务，完善教师工作闭环。真正做到“教好每一个学生，办好 每一件事”；' },
          { text: '倡导教师不断自我学习提升、与时俱进，做一个有教育情怀、教育梦想、教育责任的优 秀少儿美术教师' }
        ]
      },
      sdys: {
        title: '课程体系',
        content: [
          { image: '../../../assets/images/kctx.jpg', class: 'kctx'}
        ]
      },
      lxwm: {
        title: '联系我们',
        content: [
          { image: '../../../assets/images/lxwm.jpg'},
          {text: '咨询电话：18531628845'},
          {text: '地址：固安县惠文东街京南绿洲底商129号希望美术教育'}
        ]
      },
      ldzc: {
        title: '领导致辞',
        content: [
          { image: '../../../assets/images/ldzc.jpg'},
          {
            text: '时光荏苒，希望已稳健地走过了十四个春秋。现已成长为全国少儿美术教育领军品牌。不断完善现代少儿美术教育课程体系，每年举办全国少儿美术师资研修班，希望正致力于提升中国人的综合素养，担当起倡导现代少儿美育的社会使命。'},
          {
            text: '希望美术教育所取得的成绩，是各级领导、社会各界朋友十四年来关心和支持的结果，是全体希望人励精图治、奋勇拼搏的结晶，凝聚着大家的智慧和汗水，值得所有希望人欣慰和自豪，并为之继续努力奋斗。'},
            {text: '希望美术教育注重想象力和创新力的培养，品格教育和艺术素养的结合。多彩艺术视界的营造和多元化课题设置更好地为孩子提供了发现自己潜力的可能。同时，我们将一如既往践行“品格第一、素质第二、兴趣第三、成绩第四”的教育观，深入贯彻“用艺术启迪智慧”的教育理念！'},
            {
              text: '大道之行，希望再起点，我们将提供最先进的少儿美术教学理念、最优质的少儿美术教育教研课件和最好的少儿美术培训解决方案。'},
            { text:'希望美术教育欢迎每一个孩子，每一个家庭，每一个有志于教育事业的伙伴的加入，让我们携手前行，为实现伟大的中国梦贡献自己一份力量。'}
        ]
      },
      zpda: {
        title: '作品档案',
        list: []
      },
      szlb: {
        title: '师资列表',
        list: []
      }
    },
    current: {}
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
    this.setData({
      current: this.data.list[this.options.q]
    })
    wx.setNavigationBarTitle({
      title: this.data.current.title
    })
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})